---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalElement.StructuralRole
source: html/e7dfb391-f0d6-9aef-8ba9-b8f05e269329.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.StructuralRole Property

The enum value depicting structural role asigned to the Analytical Element.

## Syntax (C#)
```csharp
public AnalyticalStructuralRole StructuralRole { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The provided AnalyticalStructuralRole is not supported
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration